# Exploratory data analysis


### 1. Reading the data

In [3]:
import pandas as pd

filename = '/Users/Guzel/Documents/KAGGLE/Human Resources Analytics/HR_comma_sep.csv'

# data ia a dataFrame object
data = pd.read_csv(filename)

# Print the head of the data frame
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [2]:
# Number of rows and columns

print(data.shape)

(14999, 10)

In [8]:
# Columns of dataFrame data
data.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'sales', 'salary'],
      dtype='object')

In [9]:
data.index

RangeIndex(start=0, stop=14999, step=1)

In [13]:
# Slicing the data

data.iloc[-5: , 2:7]

,number_project,average_montly_hours,time_spend_company,Work_accident,left
14994,2,151,3,0,1
14995,2,160,3,0,1
14996,2,143,3,0,1
14997,6,280,4,0,1
14998,2,158,3,0,1